{
  "home": "Home",
  "about_me": "About Me",
  "project": "Projects",
  "contacts": "Contact",
  "experience": "Experience",
  "my_name_is": "Hi, my name is",
  "and_i_am": "and I am",
  "developer": "Back-End Developer",
  "about_me_paragraph": {
    "1": "Hello, I’m João Arthur, a Computer Engineering student and back-end developer seeking my first professional experience. I have a solid foundation in <b>back-end development</b>, with a focus on <b>Java and the Spring Boot framework</b>. My experience includes working with <b>SQL databases</b> such as <b>MySQL and PostgreSQL</b>, and exploring tools like <b>Docker, AWS, and RESTful APIs</b>. In recent projects, I have always aimed to implement <b>efficient and scalable solutions</b>, maintaining <b>clean and organized code</b>. Additionally, I am familiar with <b>agile methodologies</b> such as <b>Scrum and Jira</b>, which I use to ensure an <b>efficient workflow</b> and deliver <b>quality results</b>.",
    "2": "In addition to my technical skills, I value teamwork and clear communication. Adaptability and a willingness to learn are traits I constantly cultivate, both at university and in personal projects. I am eager to apply my knowledge and contribute to innovative projects while continuing to grow and develop as a professional."
  },
  "tech_stack": "Tech Stack",
  "resume_pt": "Résumé PT-BR",
  "resume_en": "Résumé EN-US",
  "contact_me": "Contact Me",
  "contact_me_subtitle": "Feel free to reach out if you have any questions or new opportunities!",
  "contact_links": "Contact Links",
  "form_name": "Your Name",
  "form_email": "Your Email",
  "form_subject": "Subject",
  "form_message": "Message",
  "form_submit": "Send Email",
  "form_success": "Message sent successfully!",
  "footer": "Designed and developed by João Arthur Britto",
  "view_certificate": "View Certificate",
  "courses": {
    "1": {
      "name": "ONE - Oracle Next Education",
      "date": "Nov 2023",
      "description": "Participating in the ONE program, offered by Oracle in partnership with Alura, was an enriching experience. The focus on back-end, with an emphasis on Java and Spring Boot, allowed me to deepen my knowledge in these essential technologies for developing robust applications. The program was well-structured, with courses covering everything from basic concepts to advanced practices, better preparing me to work on more complex projects in the Java ecosystem.",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBSFSmaZIZ9xSP6HyNsytS5k7f_BfN9fg6rQ&s",
      "certificateLink": "https://cursos.alura.com.br/program/certificate/8fafa83c-5ae6-4004-bb28-f6cb55e85d6f"
    },
    "2": {
      "name": "Meta - Version Control",
      "date": "Sep 2023",
      "description": "The Meta course on version control was crucial for enhancing my understanding of versioning, especially using Git and GitHub. The course covered everything from basic concepts like commits and branches to more advanced strategies like merges and conflict resolution. This experience gave me more confidence in collaborating on team projects, as well as helping me maintain a clear and organized history of code changes, which is essential for any developer.",
      "image": "https://pngimg.com/d/meta_PNG5.png",
      "certificateLink": "https://coursera.org/share/1f2131878c684c8eb8ec2f3ae30cf901"
    },
    "3": {
      "name": "Meta - Introduction to Back-End Development",
      "date": "Aug 2023",
      "description": "The Introduction to Back-End Development course was an excellent opportunity to enhance my software development skills. I learned fundamental back-end concepts such as APIs, databases, and authentication. The course provided a solid foundation for understanding how software works and the challenges of developing robust and scalable applications.",
      "image": "https://pngimg.com/d/meta_PNG5.png",
      "certificateLink": "https://coursera.org/share/650e928251063a9048d761898d83c41b"
    },
    "4": {
      "name": "Harvard CS50 - Introduction to Computer Science",
      "date": "Jul 2023",
      "description": "Harvard's CS50 is a renowned introductory computer science course that explores fundamental concepts such as algorithms, data structures, cryptography, networks, and software systems. Taking Harvard's CS50 was a transformative experience for me. The course challenged my way of thinking with algorithms and data structures, and it was a great opportunity to learn programming in C, which initially seemed intimidating but became rewarding. Additionally, I delved into technologies like SQL and Flask, which broadened my view of web development.",
      "image": "https://cdn.freebiesupply.com/images/large/2x/harvard-logo-transparent.png",
      "certificateLink": "https://certificates.cs50.io/78894551-7bbe-4b0b-922d-de593da0b335.pdf?size=letter"
    },
    "5": {
      "name": "IBM - Python 101 for Data Science",
      "date": "Jul 2023",
      "description": "Taking IBM's Python course was an important experience for my development with Python, especially applied to data science. I learned fundamental programming concepts and how to use essential libraries like Pandas and Numpy for data manipulation and analysis. The course also helped me understand how Python can be a powerful tool for processing large volumes of information, providing a solid foundation for future data science projects.",
      "image": "https://www.sharewayre.com/wp-content/uploads/2024/06/IBM_logo.svg_.png",
      "certificateLink": "https://courses.cognitiveclass.ai/certificates/73c3e954467c46bebd5682e4131190c8/"
    }
  },
  "projects": {
    "01": {
      "number": "01",
      "name": "AFADFAL System",
      "description": "The AFADFAL, is a web system that was developed for a non-profit organization, using a robust and modern tech stack. On the back-end, Spring Boot was implemented, along with Hibernate for managing the MySQL database, providing a solid and efficient foundation for data storage. The front-end was developed with React, offering a dynamic and user-friendly interface. The application was deployed on AWS EC2 and containerized with Docker, ensuring scalability and ease of maintenance. Additionally, tools such as Swagger were used for API documentation, and Lombok and Maven were employed to optimize development.",
      "images": [
        "https://lh3.googleusercontent.com/d/1m0i_RuNNzJgfkbcJXpBeL_7Uay_PztF0",
        "https://lh3.googleusercontent.com/d/1SEaTIFSZuHRPckgLCEGEgM5RwvTjfl--",
        "https://lh3.googleusercontent.com/d/106iA4hNUv3SnTaATHaKKwtO82mHEoXkB",
        "https://lh3.googleusercontent.com/d/1zoXZY16u6ux30UdcK1NLr3TbwI9OY8tx",
        "https://lh3.googleusercontent.com/d/1R7__YVXJRAxmKhq9PKdlD-Ty-Ae2p5hM",
        "https://lh3.googleusercontent.com/d/1txEJLt0eUPhCGXQ5SpCzuYH0T8IoVhbj",
        "https://lh3.googleusercontent.com/d/1ngMrIUfMUnaTCnFovn9naq8j0ft6vMSO"
      ]
    },
    "02": {
      "number": "02",
      "name": "TicketFlow",
      "description": "TicketFlow is a full-stack web application for event ticket management. It uses React on the front-end with Styled Components and dynamic animations, while the back-end is developed in Spring Boot with MySQL as the database. The application is containerized with Docker to facilitate deployment and ensure scalability.",
      "images": [
        "https://lh3.googleusercontent.com/d/1cy4MQkRKYKUJQbJNXL3e_FhPhAHu3pwY",
        "https://lh3.googleusercontent.com/d/1sO2A8qjt_c4Xn28wl0dx_fptpB-TyRyO",
        "https://lh3.googleusercontent.com/d/1IHPStmUIdH_QFA7G_XDs8urDguUyajZ2",
        "https://lh3.googleusercontent.com/d/1Qt6yXCQ5gdnQizTnGU-XEPXtF9KmdeC7"
      ],
      "githubLink": "https://github.com/sistema-de-ingressos",
      "link": "https://ticketflow-linux.onrender.com/"
    },
    "03": {
      "number": "03",
      "name": "Medical Clinic System",
      "description": "Along with my team, I developed a full-stack web application for clinic management, using Spring Boot on the back-end and React on the front-end. The system includes features such as a password panel for triage, call panel, triage queue, and service summary, all integrated with a MySQL database. The application is containerized with Docker and deployed on AWS EC2, ensuring reliability and scalability.",
      "images": [
        "https://lh3.googleusercontent.com/d/1VdGqYTgmzoSlb8SBnOATIpoJ_CXNoXmA",
        "https://lh3.googleusercontent.com/d/1Ft_s6mOHAd7faVEq-8_U-ziBcScLyk4b",
        "https://lh3.googleusercontent.com/d/1ibErxcFYIyDNcbJzEPlC3GXX3XSyg5F3",
        "https://lh3.googleusercontent.com/d/1SwdE49J0L19rtchI4QxCR3YvKQe7ZZoP"
      ],
      "githubLink": "https://github.com/sistema-clinica"
    },
    "04": {
      "number": "04",
      "name": "GymTech",
      "description": "GymTech is a web application for managing gym activities and training sessions, developed with Django on the back-end and PostgreSQL as the database. The application includes features for managing training schedules, users, and workouts, with an emphasis on backend development and optimization.",
      "images": [
        "https://lh3.googleusercontent.com/d/1_NfULjpYWaskCi8wUDfbrqdGVEsaVMOO",
        "https://lh3.googleusercontent.com/d/1LdxjADi-3b56WEqCoBmLa63p_bv6-Nmc",
        "https://lh3.googleusercontent.com/d/1rp3zfDaRAelG0xsqPnW-Y17AB86hlduE",
        "https://lh3.googleusercontent.com/d/1-n5gV6Hc7iHfq4HgYQ4f93yB1W4fus1G",
        "https://lh3.googleusercontent.com/d/12xJud2g0OYMPpPUFFfG-JmS1UhHyVOeZ",
        "https://lh3.googleusercontent.com/d/1xfLHXN_gBoWiPzNl9rWmqGh8OVjnFsd2",
        "https://lh3.googleusercontent.com/d/1Oq0LAUUf5v3ajNAkcrFH8RylmIGNw-zp"
      ],
      "link": "https://gymtech.cloud/",
      "githubLink": "https://github.com/j0aoarthur/GymTech"
    }
  }
}
